/*Создать класс Car, Engine и Driver.
        Класс Driver содержит поля - ФИО, стаж вождения.
        Класс Engine содержит поля - мощность, производитель.
        Класс Car содержит поля - марка автомобиля, класс автомобиля, вес, водитель типа Driver, мотор типа Engine.
        Методы start(), stop(), turnRight(), turnLeft(), которые выводят на печать:
        "Поехали", "Останавливаемся", "Поворот направо" или "Поворот налево".
        А также метод toString(), который выводит полную информацию об автомобиле, ее водителе и моторе.*/

package lesson4.part2;

public class Normal {
    public static void main(String[] args) {


    class Engine {

    }
    }
}
